app/Controllers/Carrito_controller.php

    public function muestra() //carrito que se muestra
{
    $categorias = new categoria_model(); // Asegúrate de que el modelo esté correctamente instanciado
    $data['categorias'] = $categorias->findAll();
---
SELECT *
FROM `categorias`