app/Controllers/Home.php

    public function index()
    {



        $categorias = new categoria_model(); // Asegúrate de que el modelo esté correctamente instanciado
        $data['categorias'] = $categorias->findAll();
        $cart = \Config\Services::cart();
        $cart = $cart->contents();
        $data['cart'] = $cart;
        $productoModel = new productos_Model(); //para ver el catalogo al inicio
        // Definir cantidad de productos por página
        $productosPorPagina = 10;
        // Obtener criterio de ordenación desde el formulario
        $orden = $this->request->getGet('orden') ?? 'ASC'; // Por defecto, orden descendente

        // Filtrar y ordenar productos activos según el precio
        $data['producto'] = $productoModel->where('eliminado', '0')
            ->orderBy('precio_vta', $orden) // Orden dinámico
            ->paginate($productosPorPagina);
---
SELECT *
FROM `categorias`
SELECT *
FROM `producto`
WHERE `eliminado` = '0'
ORDER BY `precio_vta` ASC
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `producto`
WHERE `eliminado` = '0'

    public function contacto()
    {
        $categorias = new categoria_model(); // Asegúrate de que el modelo esté correctamente instanciado
        $data['categorias'] = $categorias->findAll();
---
SELECT *
FROM `categorias`

    public function terminos_Usos()
    {
        $categorias = new categoria_model(); // Asegúrate de que el modelo esté correctamente instanciado
        $data['categorias'] = $categorias->findAll();
---
SELECT *
FROM `categorias`

    public function login()
    {
        $categorias = new categoria_model(); // Asegúrate de que el modelo esté correctamente instanciado
        $data['categorias'] = $categorias->findAll();
---
SELECT *
FROM `categorias`