app/Controllers/Productos_controller.php

SELECT *
FROM `producto`
SELECT *
FROM `categorias`
---
    public function creaproducto()
    {

        $producto = new productos_model();
        $data['producto'] =  $producto->findAll(); // obtener todos los productos
        $categorias = new categoria_model(); // Asegúrate de que el modelo esté correctamente instanciado
        $data['categorias'] = $categorias->findAll();

SELECT *
FROM `producto`
---
    public function index()
    {
        $producto = new productos_model();
        //realizo la consulta para mostrar todos los productos
        $data['producto'] =  $producto->findAll(); //getProductoAll();funcion en el modelo

SELECT *
FROM `producto`
---
    public function eliminados()
    {
        $productoModel = new productos_model();
        $data['producto'] = $productoModel->findAll();

SELECT *
FROM `categorias`
SELECT *
FROM `producto`
WHERE `eliminado` = '0'
AND `categoria_id` = '1'
ORDER BY `id_producto` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `producto`
WHERE `eliminado` = '0'
AND `categoria_id` = '1'
---
    public function catalogoPorCategoria($id)
    {
        $categorias = new categoria_model(); // Asegúrate de que el modelo esté correctamente instanciado
        $data['categorias'] = $categorias->findAll();
        //encuentra la categoria
        $categoriaModel = new categoria_model();
        //Para añadir paginación en CodeIgniter 4, se usa el método paginate()
        $productoModel = new productos_Model();

        // Definir cantidad de productos por página
        $productosPorPagina = 10;

        // where() solo acepta un par clave-valor o un array.
        $data['producto'] = $productoModel->where(['eliminado' => '0', 'categoria_id' => $id])
            ->orderBy('id_producto', 'DESC')
            ->paginate($productosPorPagina);

SELECT *
FROM `categorias`
SELECT *
FROM `producto`
WHERE   (
`nombre_prod` LIKE '%alas de sangre%' ESCAPE '!'
OR  `autor` LIKE '%alas de sangre%' ESCAPE '!'
 )
AND `eliminado` = '0'
ORDER BY `id_producto` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `producto`
WHERE   (
`nombre_prod` LIKE '%alas de sangre%' ESCAPE '!'
OR  `autor` LIKE '%alas de sangre%' ESCAPE '!'
 )
AND `eliminado` = '0'
---
    public function buscar()
    {
        $categorias = new categoria_model(); // Asegúrate de que el modelo esté correctamente instanciado
        $data['categorias'] = $categorias->findAll();
        $productoModel = new productos_Model();
        $termino = $this->request->getGet('query');

        // Filtrar productos por nombre o autor
        $data['producto'] = $productoModel->groupStart()
            ->like('nombre_prod', $termino)
            ->orLike('autor', $termino) //para que el usuario pueda buscar por nombre o por autor del libro
            ->groupEnd()
            ->where('eliminado', '0')
            ->orderBy('id_producto', 'DESC')
            ->paginate(10);