app/Controllers/Usuario_controller.php

    public function editar_usuario($id_usuario = null){
        // Asegurar que la usuario esté conectada
        if (!session()->get('logged_in')) {
            return redirect()->to(site_url('/login'));
        }

        $usuarioModel = new usuarios_model();
        $perfilModel = new perfiles_model();

        // Verificar si el usuario conectado es administrador (perfil_id = 1)
        // Si no es administrador, asegurarse de que solo pueda editar su propio perfil.
        if (session()->get('perfil_id') != 1 && session()->get('id_usuario') != $id_usuario) {
            session()->setFlashdata('error', 'No tienes permiso para editar este usuario.');
            return redirect()->back(); // O redirigir a su propia página de edición de perfil
        }

        $user = $usuarioModel->find($id_usuario);

        if (!$user) {
            session()->setFlashdata('error', 'Usuario no encontrado.');
            return redirect()->to(site_url('/listaUsuarios')); // Redirigir a la lista de usuarios si no se encuentra
        }

        $data['user_data'] = $user;
        $data['perfiles'] = $perfilModel->findAll(); // Obtener todos los perfiles para que el administrador cambie el rol del usuario
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '35'
SELECT *
FROM `perfiles`