app/Controllers/Ventas_controller.php

SELECT *
FROM `categorias`
---
    public function ventas()
    {
        $categorias = new categoria_model();
        $data['categorias'] = $categorias->findAll();