app/Models/consultas_model.php

    public function getConsultas(){
     return $this->findAll();
---
SELECT *
FROM `consultas`