app/Models/Ventas_cabecera_model.php

    public function getBuilderVentas_cabecera()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('ventas_cabecera');
        // Seleccionamos todas las columnas de ventas_cabecera, y nombre y apellido del usuario
        $builder->select('*');
        // Usamos LEFT JOIN para que las ventas se muestren incluso si el usuario_id no coincide
        $builder->join('usuarios', 'usuarios.id_usuario = ventas_cabecera.usuario_id  ', 'left');
        $query = $builder->get();
---
SELECT *
FROM `ventas_cabecera`
LEFT JOIN `usuarios` ON `usuarios`.`id_usuario` = `ventas_cabecera`.`usuario_id`